event.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Events and Filters</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Events and Filters"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-16T23:59+0900"/>
<meta name="author" content="@toshi_a"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="event.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Events and Filters</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Twitter</a>
<ul>
<li><a href="#sec-1-1">appear</a></li>
<li><a href="#sec-1-2">update</a></li>
<li><a href="#sec-1-3">favorite</a></li>
<li><a href="#sec-1-4">follow</a></li>
<li><a href="#sec-1-5">mention</a></li>
<li><a href="#sec-1-6">mypost</a></li>
<li><a href="#sec-1-7">posted</a></li>
<li><a href="#sec-1-8">retweet</a></li>
<li><a href="#sec-1-9">retweet_destroyed</a></li>
<li><a href="#sec-1-10">unfavorite</a></li>
</ul>
</li>
<li><a href="#sec-2">GUI関連</a>
<ul>
<li><a href="#sec-2-1">after_gui_tab_reordered</a></li>
<li><a href="#sec-2-2">after_gui_tab_reparent</a></li>
<li><a href="#sec-2-3">before_postbox_post</a></li>
<li><a href="#sec-2-4">gui_timeline_move_cursor_to</a></li>
<li><a href="#sec-2-5">gui_window_rewindstatus</a></li>
</ul>
</li>
<li><a href="#sec-3">Gtk関連</a>
<ul>
<li><a href="#sec-3-1">gui_get_gtk_widget</a></li>
</ul>
</li>
<li><a href="#sec-4">内部処理</a>
<ul>
<li><a href="#sec-4-1">achievement_took</a></li>
<li><a href="#sec-4-2">entity_linkrule_added</a></li>
<li><a href="#sec-4-3">extract_tab_create</a></li>
<li><a href="#sec-4-4">extract_tab_update</a></li>
<li><a href="#sec-4-5">extract_tab_delete</a></li>
<li><a href="#sec-4-6">image_cache_saved</a></li>
<li><a href="#sec-4-7">mikutwitter_ratelimit</a></li>
<li><a href="#sec-4-8">modify_activity</a></li>
<li><a href="#sec-4-9">open_setting</a></li>
<li><a href="#sec-4-10">processtime</a></li>
<li><a href="#sec-4-11">query_end</a></li>
<li><a href="#sec-4-12">query_start</a></li>
<li><a href="#sec-4-13">send_bugreport</a></li>
<li><a href="#sec-4-14">show_profile</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Twitter</h2>
<div class="outline-text-2" id="text-1">

<p>  Twitter APIのレスポンスから引き起こされるイベント。Twitterで発生した事象をトリガーにできる。
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">appear</h3>
<div class="outline-text-3" id="text-1-1">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Messages</a></dt><dd>Messageの配列
</dd>
</dl>

<p>   生成されたありとあらゆるMessageを受信する。
   coreプラグインのフィルタによって、一度渡されたMessageは二度と渡されないようになっている。
   同時に大量のappearイベントが起こる場合は、配列に複数のMessageが渡され、イベントがひとつに纏められることがある。
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">update</h3>
<div class="outline-text-3" id="text-1-2">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>アカウント情報
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Messages</a></dt><dd>Messageの配列
</dd>
</dl>

<p>   ホームタイムラインに入るMessageを受信した時に発生する。restプラグインで定期的に取得したものと、streamingプラグインでUserStreamによって取得されたMessageが渡される。
   coreプラグインのフィルタによって、一度渡されたMessageは二度と渡されないようになっている。
   同時に大量のupdateイベントが起こる場合は、配列に複数のMessageが渡され、イベントがひとつに纏められることがある。
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">favorite</h3>
<div class="outline-text-3" id="text-1-3">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>受信したアカウント
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/User.html">User</a></dt><dd>イベントを発生したユーザ
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Message</a></dt><dd>お気に入り登録されたMessage
</dd>
</dl>

<p>   UserがMessageをお気に入り登録をされたことを通知する。通知のためのイベントなので、フィルタすることは出来ない。
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">follow</h3>
<div class="outline-text-3" id="text-1-4">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/User.html">User</a></dt><dd>フォローしたユーザ
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/User.html">User</a></dt><dd>フォローされたユーザ
</dd>
</dl>

<p>   前者のユーザが後者のユーザをフォローした時に発生する。
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">mention</h3>
<div class="outline-text-3" id="text-1-5">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>アカウント情報
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Messages</a></dt><dd>Messageの配列
</dd>
</dl>

<p>   リプライを受信した時に発生する。restプラグインで定期的に取得したものと、streamingプラグインでUserStreamによって取得されたMessageが渡される。
   coreプラグインのフィルタによって、一度渡されたMessageは二度と渡されないようになっている。
   同時に大量のupdateイベントが起こる場合は、配列に複数のMessageが渡され、イベントがひとつに纏められることがある。
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">mypost</h3>
<div class="outline-text-3" id="text-1-6">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>アカウント情報
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Messages</a></dt><dd>Messageの配列
</dd>
</dl>

<p>   自分の投稿を受信した時に発生する。mikutterから投稿したものと、restやstreamingプラグインによって、他のアプリケーションから自分が投稿したMessageも受け取る。
   coreプラグインのフィルタによって、一度渡されたMessageは二度と渡されないようになっている。
   同時に大量のmypostイベントが起こる場合は、配列に複数のMessageが渡され、イベントがひとつに纏められることがある。
</p>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">posted</h3>
<div class="outline-text-3" id="text-1-7">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>アカウント
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Messages</a></dt><dd>自分の投稿
</dd>
</dl>

<p>   Serviceの投稿したMessageを受け取る。
   coreプラグインのフィルタによって、一度渡されたMessageは二度と渡されないようになっている。
   同時に大量のappearイベントが起こる場合は、配列に複数のMessageが渡され、イベントがひとつに纏められることがある。
</p></div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">retweet</h3>
<div class="outline-text-3" id="text-1-8">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Messages</a></dt><dd>リツイートの配列
</dd>
</dl>

<p>   受信したすべてのReTweetをMessageとして受け取る。
</p></div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9">retweet_destroyed</h3>
<div class="outline-text-3" id="text-1-9">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Message</a></dt><dd>リツイートされていたMessage
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/User.html">User</a></dt><dd>リツイートしていたUser
</dd>
<dt>Numeric</dt><dd>リツイートのstatus_id
</dd>
</dl>

<p>   UserがMessageにたいして行なっていたリツイートを取り消したことを通知する。通知イベントなのでフィルタすることは出来ない。
</p>
</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10">unfavorite</h3>
<div class="outline-text-3" id="text-1-10">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>受信したアカウント
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/User.html">User</a></dt><dd>イベントを発生したユーザ
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Message.html">Message</a></dt><dd>お気に入り登録されたMessage
</dd>
</dl>

<p>   UserがMessageをお気に入り登録解除したことを通知する。通知のためのイベントなので、フィルタすることは出来ない。
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">GUI関連</h2>
<div class="outline-text-2" id="text-2">

<p>  GUI操作は殆どがイベントによって実現されている。これによって、プラグインから柔軟な操作ができるようになっている。
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">after_gui_tab_reordered</h3>
<div class="outline-text-3" id="text-2-1">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Tab.html">Plugin::GUI::Tab</a></dt><dd>移動されたタブ
</dd>
</dl>

<p>   タブが移動された後に発生するイベント
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">after_gui_tab_reparent</h3>
<div class="outline-text-3" id="text-2-2">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Tab.html">Plugin::GUI::Tab</a></dt><dd>移動されたタブ
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Pane.html">Plugin::GUI::Pane</a></dt><dd>新しい親Pane
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Pane.html">Plugin::GUI::Pane</a></dt><dd>以前の親Pane
</dd>
</dl>

<p>   タブが別のペインに移動された後に発生するイベント
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">before_postbox_post</h3>
<div class="outline-text-3" id="text-2-3">

<dl>
<dt>String</dt><dd>投稿しようとしている内容
</dd>
</dl>

<p>   PostBoxから投稿しようとしているテキストをイベントとして受け取れる。このイベントは通知用なので、フィルタすることは出来ない。
   ただし、フィルタを使うことで、確実に投稿される直前にある処理を実行することができる。
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">gui_timeline_move_cursor_to</h3>
<div class="outline-text-3" id="text-2-4">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Timeline.html">Plugin::GUI::Timeline</a></dt><dd>対象になるタイムライン
</dd>
<dt>Symbol|Numeric</dt><dd>移動する向き(:prev or :next)か、画面上のy座標
</dd>
</dl>

<p>   TLのフォーカスを前後どちらかに動かす。数値が指定された場合は、表示上のy座標の値が指しているMessageにフォーカスを移動する。
</p>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">gui_window_rewindstatus</h3>
<div class="outline-text-3" id="text-2-5">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Window.html">Plugin::GUI::Window</a></dt><dd>ウィンドウ
</dd>
<dt>String</dt><dd>ステータスバーの文字列
</dd>
<dt>Numeric</dt><dd>有効期限(sec)
</dd>
</dl>

<p>   指定された秒数の間、指定されたウィンドウのステータスバーに文字列を表示する。
   ステータスバーはアクティビティから更新されるべきで、このイベントは直接使ってはならない。
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Gtk関連</h2>
<div class="outline-text-2" id="text-3">

<p>  Gtkプラグインは、UIをGtk2でレンダリングするための標準プラグイン。
  このプラグインもいくつかのイベントやフィルタを提供してる。
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">gui_get_gtk_widget</h3>
<div class="outline-text-3" id="text-3-1">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Plugin/GUI/Widget.html">Plugin::GUI::Widget</a></dt><dd>仮想ウィジェット
</dd>
</dl>

<p>   渡されたウィジェットを対応するGtk::Widgetのサブクラスのインスタンスに変換する。
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">内部処理</h2>
<div class="outline-text-2" id="text-4">

<p>  内部処理は、通常はメソッドにラップされていて、callやlistenしないようなイベントのこと。
  例えば、あるメソッドを呼べば実は内部的にはイベントの発火をしていて、コアがそのイベントを受け取って何らかの処理をしているという場合がこれにあたる。
  また、通知のために用意されて入るが、標準ではそのイベントを受け取らないというものも含まれる。
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">achievement_took</h3>
<div class="outline-text-3" id="text-4-1">

<dl>
<dt>Plugin::Achievement::Achievement</dt><dd>解除された実績オブジェクト
</dd>
</dl>

<p>   実績が解除された時に呼ばれる。achievementプラグインがこのイベントを受け取ると、アクティビティに実績解除の通知が表示される。
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">entity_linkrule_added</h3>
<div class="outline-text-3" id="text-4-2">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>slug</dt><dd>スラッグ
</dd>
<dt>filter_id</dt><dd>内部フィルターID
</dd>
<dt>regexp</dt><dd>エンティティを貼る範囲にマッチする正規表現
</dd>
<dt>callback</dt><dd>クリックされた時のコールバックブロック
</dd>
</dl>

</dd>
</dl>


<p>
   エンティティの新規登録をする。@&hellip;やURLにリンクを張るときに使う。通常はこのイベントを直接発火すべきでない。
   そのような用途には、 <a href="#Message-Entity-addlinkrule">Message::Entity#addlinkrule</a> を使う。
   引数は以下の様なキーを持つHashオブジェクト
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">extract_tab_create</h3>
<div class="outline-text-3" id="text-4-3">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>name</dt><dd>タブの名前
</dd>
<dt>sexp</dt><dd>抽出条件(MIKU Langで評価できるS式)
</dd>
<dt>sources</dt><dd>データソースの配列
</dd>
<dt>id</dt><dd>抽出タブのID
</dd>
</dl>

</dd>
</dl>

<p>   抽出タブを新しく作成する。
</p></div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">extract_tab_update</h3>
<div class="outline-text-3" id="text-4-4">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>name</dt><dd>タブの名前
</dd>
<dt>sexp</dt><dd>抽出条件(MIKU Langで評価できるS式)
</dd>
<dt>sources</dt><dd>データソースの配列
</dd>
<dt>id</dt><dd>抽出タブのID
</dd>
</dl>

</dd>
</dl>

<p>   抽出タブの情報を更新する
</p></div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5">extract_tab_delete</h3>
<div class="outline-text-3" id="text-4-5">

<dl>
<dt>Numeric</dt><dd>抽出タブのID
</dd>
</dl>

<p>   抽出タブを削除する
</p></div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6">image_cache_saved</h3>
<div class="outline-text-3" id="text-4-6">

<dl>
<dt>String</dt><dd>URL
</dd>
<dt>String</dt><dd>画像ファイルのバイナリデータ
</dd>
</dl>

<p>   URLの画像がメモリキャッシュに載った時に呼ばれるイベント。画像をファイルキャッシュするプラグインは、このイベントを受信したら画像をファイルに書き出している。
</p>
</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7">mikutwitter_ratelimit</h3>
<div class="outline-text-3" id="text-4-7">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/MikuTwitter/Query.html">MikuTwitter::Query</a></dt><dd>MikuTwitterオブジェクト
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/MikuTwitter/RateLimiting.html">MikuTwitter::RateLimiting</a></dt><dd>規制オブジェクト
</dd>
</dl>


<p>   
   規制されている状態でAPIリクエストをするとそのエンドポイント毎に呼ばれるイベント。
   ただし、同じエンドポイントの同じウィンドウ内で二回以上呼ばれることはない。
</p></div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8">modify_activity</h3>
<div class="outline-text-3" id="text-4-8">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>kind</dt><dd>アクティビティの種類
</dd>
<dt>title</dt><dd>タイトル
</dd>
<dt>date</dt><dd>発生時刻
</dd>
<dt>description</dt><dd>詳細
</dd>
</dl>

</dd>
</dl>

<p>   activityが発生した時のイベント。これをactivityプラグインが受け取ると、然るべき通知がされる。
   普通、PluginDSLのactivityメソッドを使って発生させる。
</p></div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9">open_setting</h3>
<div class="outline-text-3" id="text-4-9">

<p>   設定を開く。
</p></div>

</div>

<div id="outline-container-4-10" class="outline-3">
<h3 id="sec-4-10">processtime</h3>
<div class="outline-text-3" id="text-4-10">

<dl>
<dt>Symbol</dt><dd>処理区分
</dd>
<dt>String</dt><dd>経過時間,ソースの行数とファイル名
</dd>
</dl>


<p>   
   DelayerやDeferredなどのブロックが一つ処理される毎に発火される。
</p></div>

</div>

<div id="outline-container-4-11" class="outline-3">
<h3 id="sec-4-11">query_end</h3>
<div class="outline-text-3" id="text-4-11">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>serial</dt><dd>リクエストシリアルナンバー
</dd>
<dt>method</dt><dd>リクエストメソッド(GETかPOST)
</dd>
<dt>path</dt><dd>エンドポイント
</dd>
<dt>options</dt><dd>リクエスト引数
</dd>
<dt>start_time</dt><dd>リクエスト開始時間
</dd>
<dt>end_time</dt><dd>リクエスト終了時間
</dd>
<dt>res</dt><dd>レスポンスオブジェクト(Net::HTTPResponse)
</dd>
<dt>mikutwitter</dt><dd>MikuTwitterオブジェクト
</dd>
<dt>ratelimit</dt><dd>規制オブジェクト
</dd>
</dl>

</dd>
</dl>

<p>   APIリクエスト終了ごとに発生するイベント。通知のみが目的なので、フィルタすることは出来ない
</p>
</div>

</div>

<div id="outline-container-4-12" class="outline-3">
<h3 id="sec-4-12">query_start</h3>
<div class="outline-text-3" id="text-4-12">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>serial</dt><dd>リクエストシリアルナンバー
</dd>
<dt>method</dt><dd>リクエストメソッド(GETかPOST)
</dd>
<dt>path</dt><dd>エンドポイント
</dd>
<dt>options</dt><dd>リクエスト引数
</dd>
<dt>start_time</dt><dd>リクエスト開始時間
</dd>
<dt>mikutwitter</dt><dd>MikuTwitterオブジェクト
</dd>
</dl>

</dd>
</dl>

<p>   APIリクエスト開始ごとに発生するイベント。通知のみが目的なので、フィルタすることは出来ない
</p>
</div>

</div>

<div id="outline-container-4-13" class="outline-3">
<h3 id="sec-4-13">send_bugreport</h3>
<div class="outline-text-3" id="text-4-13">

<dl>
<dt>Hash</dt><dd>オプション値
<dl>
<dt>backtrace</dt><dd>バックトレース(JSON文字列)
</dd>
<dt>file</dt><dd>クラッシュしたファイル
</dd>
<dt>line</dt><dd>行数
</dd>
<dt>exception_class</dt><dd>例外クラス
</dd>
<dt>description</dt><dd>例外文字列
</dd>
<dt>ruby_version</dt><dd>RUBY_VERSION の値
</dd>
<dt>rubygtk_version</dt><dd>RubyGtkのバージョン
</dd>
<dt>platform</dt><dd>RUBY_PLATFORM の値
</dd>
<dt>version</dt><dd>Environment::VERSION の値
</dd>
</dl>

</dd>
</dl>

<p>   バグレポートを送信したことを通知するイベント。
</p>
</div>

</div>

<div id="outline-container-4-14" class="outline-3">
<h3 id="sec-4-14">show_profile</h3>
<div class="outline-text-3" id="text-4-14">

<dl>
<dt><a href="http://mikutter.hachune.net/rdoc/Service.html">Service</a></dt><dd>自分のアカウント
</dd>
<dt><a href="http://mikutter.hachune.net/rdoc/User.html">User</a></dt><dd>表示するユーザ
</dd>
</dl>

<p>   profileプラグインがこれを受け取ると、Userのプロフィールタブが生成される。
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-16T23:59+0900</p>
<p class="author">Author: @toshi_a</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
